events/NewConcept/ALERT.Metadata.ConceptNew.Stored.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
	<soap:Header/>
	<soap:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic/>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>METADATASERVICE</ns1:sender>
							<ns1:timestamp>10003</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10020</ns1:endTime>
								<ns1:eventName>ALERT.Metadata.ConceptNew.Stored</ns1:eventName>
								<ns1:eventId>5748</ns1:eventId>
								<ns1:eventType>reply</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<ns1:newRDFData>
									<rdf:RDF xmlns:rdf="http://www.w3.org/1999/02/22-rdf-syntax-ns#" xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#" xmlns:owl="http://www.w3.org/2002/07/owl#" xmlns:predicate="http://ailab.ijs.si/alert/predicate/">
										<rdf:Description rdf:about="http://ailab.ijs.si/alert/resource/Linux">
											<rdfs:label xml:lang="en">Linux</rdfs:label>
											<rdfs:comment>Linux refers to the family of Unix-like computer operating systems using the Linux kernel. Linux can be installed on a wide variety of computer hardware, ranging from mobile phones, tablet computers, routers and video game consoles, to desktop computers, mainframes and supercomputers. Linux is a leading server operating system, and runs the 10 fastest supercomputers in the world. The development of Linux is one of the most prominent examples of free and open source software collaboration; typically all the underlying source code can be used, freely modified, and redistributed, both commercially and non-commercially, by anyone under licenses such as the GNU General Public License. Typically Linux is packaged in a format known as a Linux distribution for desktop and server use. Some popular mainstream Linux distributions include Debian (and its derivatives such as Ubuntu), Fedora and openSUSE. Linux distributions include the Linux kernel, supporting utilities and libraries and usually a large amount of application software to fulfill the distribution's intended use. A distribution oriented toward desktop use may include the X Window System, the GNOME and KDE Plasma desktop environments. Other distributions may include a less resource intensive desktop such as LXDE or Xfce for use on older or less-powerful computers. A distribution intended to run as a server may omit any graphical environment from the standard install and instead include other software such as the Apache HTTP Server and a SSH server like OpenSSH. Because Linux is freely redistributable, it is possible for anyone to create a distribution for any intended use. Commonly used applications with desktop Linux systems include the Mozilla Firefox web browser, the OpenOffice. org or LibreOffice office application suites, and the GIMP image editor. The name "Linux" comes from the Linux kernel, originally written in 1991 by Linus Torvalds. The main supporting user space system tools and libraries from the GNU Project (announced in 1983 by Richard Stallman) are the basis for the Free Software Foundation's preferred name GNU/Linux.</rdfs:comment>
											<!-- will be added as properties -->
											<owl:sameAs rdf:resource="http://dbpedia.org/resource/Linux"/>
											<predicate:linksTo rdf:resource="http://ailab.ijs.si/alert/resource/korganizer" />
											<predicate:linksTo rdf:resource="http://ailab.ijs.si/alert/resource/installed" />
											<predicate:linksTo rdf:resource="http://ailab.ijs.si/alert/resource/lib" />
											<predicate:linksTo rdf:resource="http://ailab.ijs.si/alert/resource/amarok" />
											<!-- SubClass relations -->
											<rdfs:subClassOf rdf:resource="http://ailab.ijs.si/alert/resource/korganizer" />
											<rdfs:subClassOf rdf:resource="http://ailab.ijs.si/alert/resource/installed" />
											<rdfs:superClassOf rdf:resource="http://ailab.ijs.si/alert/resource/lib" />
											<rdfs:superClassOf rdf:resource="http://ailab.ijs.si/alert/resource/amarok" />
										</rdf:Description>
										<rdf:Description rdf:about="http://ailab.ijs.si/alert/resource/korganizer" />
										<rdf:Description rdf:about="http://ailab.ijs.si/alert/resource/installed" />
										<rdf:Description rdf:about="http://ailab.ijs.si/alert/resource/lib" />
										<rdf:Description rdf:about="http://ailab.ijs.si/alert/resource/amarok" />
									</rdf:RDF>
								</ns1:newRDFData>
								<o:mdservice>
									<o:concepts>
										<o:conceptUri>http://ailab.ijs.si/alert/resource/Linux</o:conceptUri>
										<o:conceptUri>http://ailab.ijs.si/alert/resource/korganizer</o:conceptUri>
										<o:conceptUri>http://ailab.ijs.si/alert/resource/installed</o:conceptUri>
										<o:conceptUri>http://ailab.ijs.si/alert/resource/lib</o:conceptUri>
										<o:conceptUri>http://ailab.ijs.si/alert/resource/amarok</o:conceptUri>
									</o:concepts>
								</o:mdservice>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>